Tekla.Structures.Analysis.AnalysisModelSpectrumProperties
The AnalysisModelSpectrumProperties class contains information related to analysis model spectrum properties.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties._AnalysisModelName
The name of the analysis model.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties._SpectrumModeCount
The count of the spectrum mode.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties._SpectrumCombination
The spectrum combination.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties._SpectrumType
The type of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties._SpectrumInterpolation
The interpolation of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties._SpectrumXdirectionEnable
This indicates whether the X direction of the spectrum is enabled.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties._SpectrumYdirectionEnable
This indicates whether the X direction of the spectrum is enabled.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties._SpectrumZdirectionEnable
This indicates whether the X direction of the spectrum is enabled.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties._SpectrumDampingType
The type of the spectrum damping.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties._SpectrumMissingMassEnable
This indicates whether the missing mass of the spectrum is enabled.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties._SpectrumModalDampingRatioEnable
This indicates whether the damping ratio of the spectrum is enabled.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties._SpectrumXdirection
The X direction of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties._SpectrumYdirection
The Y direction of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties._SpectrumZdirection
The Z direction of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties._SpectrumDampingFactor
The damping factor of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties._SpectrumScale
The scape of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties._SpectrumMissingMass
The missing mass of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties._SpectrumASCEf1
The ASCEf1 value of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties._SpectrumASCEf2
The ASCEf2 value of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties._SpectrumMinimumDampingRatio
The minimum damping ratio of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties._SpectrumMaximumDampingRatio
The maximum damping ratio of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties._SpectrumPeriod
The list of the periods of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties._SpectrumAcceleration
The list of the accelerations of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties._SpectrumModalDampingRatio
The list of the modal damping ratios of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties._SpectrumDampingPointId
The list of the damping point identifiers of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties._SpectrumCompositeDampingRatioX
The list of the composite dampinf rations in X direction of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties._SpectrumCompositeDampingRatioY
The list of the composite dampinf rations in Y direction of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties._SpectrumCompositeDampingRatioZ
The list of the composite dampinf rations in > direction of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties.SpectrumModeCount
The count of the spectrum mode.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties.SpectrumCombination
The spectrum combination.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties.SpectrumType
The type of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties.SpectrumInterpolation
The interpolation of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties.SpectrumXdirectionEnable
Indicates whether the X direction of the spectrum is enabled.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties.SpectrumYdirectionEnable
Indicates whether the Y direction of the spectrum is enabled.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties.SpectrumZdirectionEnable
Indicates whether the Z direction of the spectrum is enabled.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties.SpectrumDampingType
The type of the spectrum damping.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties.SpectrumMissingMassEnable
Indicates whether the missing mass of the spectrum is enabled.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties.SpectrumModalDampingRatioEnable
Indicates whether the damping ratio of the spectrum is enabled.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties.SpectrumXdirection
The X direction of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties.SpectrumYdirection
The Y direction of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties.SpectrumZdirection
The Z direction of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties.SpectrumDampingFactor
The damping factor of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties.SpectrumScale
The scale of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties.SpectrumMissingMass
The missing mass of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties.SpectrumASCEf1
The ASCEf1 value of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties.SpectrumASCEf2
The ASCEf2 value of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties.SpectrumMinimumDampingRatio
The minimum damping ratio of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties.SpectrumMaximumDampingRatio
The maximum damping ratio of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties.SpectrumPeriod
The list of the periods of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties.SpectrumAcceleration
The list of the accelerations of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties.SpectrumModalDampingRatio
The list of the modal damping ratios of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties.SpectrumDampingPointID
The list of the damping point identifiers of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties.SpectrumCompositeDampingRatioX
The list of the composite damping rations in the X direction of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties.SpectrumCompositeDampingRatioY
The list of the composite damping rations in the Y direction of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties.SpectrumCompositeDampingRatioZ
The list of the composite damping rations in the Z direction of the spectrum.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties.Modify(System.String)
Inserts the analysis model spectrum properties.
The AnalysisModelName has to be set.
AnalysisModelName: The name of the analysis model.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties.Select(System.String)
Selects the analysis model spectrum properties.
The AnalysisModelName has to be set.

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties.ModifyInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisModelSpectrumProperties.SelectInstance
DO NOT USE! For internal usage only!